app/Services/Tool.php

select * from `recouvrements` where `credit_id` = 1093
---
    public function sum_encours_actualise($id)
    {
        $item = Recouvrement::where('credit_id', $id)->get();

select * from `recouvrements` where `credit_id` = 1093
---
    public function sum_recouvrement_jrs($id)
    {
        $item = Recouvrement::where('credit_id', $id)->get();

select * from `recouvrements` where `credit_id` = 1093
---
    public function sum_epargne_jrs($id)
    {
        $item = Recouvrement::where('credit_id', $id)->get();

        return $item->sum('epargne_jrs') ?? 0;

select * from `recouvrements` where `credit_id` = 1093 limit 1
---
    public function sum_assurance($id)
    {
        $item = Recouvrement::where('credit_id', $id)->get();

        return $item->sum('assurance') ?? 0;

select * from `recouvrements` where `credit_id` = 1093
---
    public function sum_interet_jrs($id)
    {
        $item = Recouvrement::where('credit_id', $id)->get();

select * from `recouvrements` where `credit_id` = 1093 limit 1
---
    public function encours_actualiser($id)
    {
        $item = Recouvrement::where('credit_id', $id)->first();

select * from `credits` where `marche_id` = 1 limit 1
select * from `recouvrements` where `marche_id` = 1 and `date` between '2024-04-29 00:00:00' and '2024-05-05 23:59:59'
---
    public function encours_global_par_marche($marche_id, $startDate, $endDate)
    {
        $mc = Credit::where('marche_id', $marche_id)->first();
        $esipm = Recouvrement::where('marche_id', $marche_id)->whereBetween('date', [$startDate, $endDate])->get();