app/View/Components/ReportingComponent.php

select marche_id,
SUM(montant) as montant from `credits` where `statut` = 'Accordé' and `created_at` between '2024-04-29 00:00:00' and '2024-05-05 23:59:59' group by `marche_id`
---
    public function currentWeekCreditByMarket()
    {
        $tool = new Tool();

        $week = $tool->week();

        $currentDataCreditByMarkets = Credit::selectRaw(
            'marche_id,
             SUM(montant) as montant'
        )
            ->groupBy('marche_id')
            ->where('statut', 'Accordé')
            ->whereBetween('created_at', [
                $week['currentWeekStartDate'],
                $week['currentWeekEndDate']
            ])->get();

select marche_id,
SUM(montant) as montant from `credits` where `statut` = 'Accordé' and `created_at` between '2024-04-22 00:00:00' and '2024-04-28 23:59:59' group by `marche_id`
---
    public function lastWeekCreditByMarket()
    {
        $tool = new Tool();

        $week = $tool->week();

        $lastDataCreditByMarkets = Credit::selectRaw(
            'marche_id,
             SUM(montant) as montant'
        )
            ->groupBy('marche_id')
            ->where('statut', 'Accordé')
            ->whereBetween('created_at', [
                $week['lastWeekStartDate'],
                $week['lastWeekEndDate']
            ])->get();

select type_id,
SUM(montant) as montant from `credits` where `statut` = 'Accordé' and `created_at` between '2024-04-22 00:00:00' and '2024-04-28 23:59:59' group by `type_id`
---
    public function lastTotalWeekTypeCredit()
    {
        $tool = new Tool();

        $week = $tool->week();

        $lastDataCreditByMarkets = Credit::selectRaw(
            'type_id,
             SUM(montant) as montant',
        )
            ->groupBy('type_id')
            ->where('statut', 'Accordé')
            ->whereBetween('created_at', [
                $week['lastWeekStartDate'],
                $week['lastWeekEndDate']
            ])->get();

select type_id,
SUM(montant) as montant from `credits` where `statut` = 'Accordé' and `created_at` between '2024-04-29 00:00:00' and '2024-05-05 23:59:59' group by `type_id`
---
    public function currentTotalWeekTypeCredit()
    {
        $tool = new Tool();

        $week = $tool->week();

        $currentDataCreditByMarkets = Credit::selectRaw(
            'type_id,
             SUM(montant) as montant',
        )
            ->groupBy('type_id')
            ->where('statut', 'Accordé')
            ->whereBetween('created_at', [
                $week['currentWeekStartDate'],
                $week['currentWeekEndDate']
            ])->get();

select * from `types`
---
    public function render()
    {
        // dd($this->lastTotalWeekTypeCredit());
        return view('components.reporting-component', [
            'currentWeekCredits' => $this->currentWeekCreditByMarket(),
            'lastWeekCredits' => $this->lastWeekCreditByMarket(),
            'currentTotalWeekTypeCredits' => $this->currentTotalWeekTypeCredit(),
            'lastTotalWeekTypeCredits' => $this->lastTotalWeekTypeCredit(),
            'markets' => $this->market(),
            'day' => $this->month(),
            'marketTypes' => Type::get(),
            'coom1' => $this->com1,
            'coom2' => $this->com2,
            'coom3' => $this->com3,
            'coom4' => $this->com4,
            'coom5' => $this->com5,
            'coom6' => $this->com6,
            'coom7' => $this->com7,
            'coom8' => $this->com8,
            'coom9' => $this->com9,
            'coom10' => $this->com10,
            'coom11' => $this->com11,
            'coom12' => $this->com12,
            'coom13' => $this->com13,