app/Http/Controllers/Controller.php

    public function __construct()
    {

        $this->comptes = Client::all();
        $this->attentes = Credit::where('statut', 'En attente')->get();
        $this->deblocages = Credit::where('statut', 'Accordé')->get();
        $this->transferts = Transfert::where('statut', 'En cours..')->get();
---
select * from `clients`
select * from `credits` where `statut` = 'Accordé'
select * from `transferts` where `statut` = 'En cours..'