app/Http/Controllers/DashboardController.php

select * from `transferts` where `pays_d` = 'Mali'
select * from `tauxes` where `libelle` = 'Frais de transfert' limit 1
select * from `tauxes` where `libelle` = 'Taxe sur activités financières' limit 1
select user_id from `recouvrements` where date(`date`) = '2024-04-19' group by `user_id`
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-19'
select * from `credits` where `statut` = 'En attente'
---
    public function index()
    {

        $transferts = Transfert::where('pays_d', auth()->user()->pays['libelle'] )->get();

        $frais = Taux::where('libelle', 'Frais de transfert')->first();

        $taf = Taux::where('libelle', 'Taxe sur activités financières')->first();

        $agents = Recouvrement::selectRaw(
            'user_id',)
         ->groupBy('user_id')->whereDate('date', Carbon::today())
         ->get();


         if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::today())->get();
          }else {
            $credits = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::today())->where('user_id', auth()->user()->id)->get();
          }

          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $prev_credits = Credit::where('statut', 'En attente')->get();

select * from `credits` where `statut` = 'Accordé' and `type_id` = '1' and date(`date_fin`) > '2024-03-20'
---

        if(auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8){

          $previsions = Credit::where('statut', 'Accordé')->where('type_id', '1')->whereDate('date_fin','>', Carbon::today()->subDays(30))->get();