app/Http/Controllers/EtatRecouvrementController.php

    public function index()
    {

        $tool = new Tool();
        $credits = [];

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $listes = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::today())->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-18'

        $recouvrements = null;

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $recouvrements = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::today())
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-18' group by `user_id`

          }

          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $hier = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::yesterday())
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-17' group by `user_id`

          }

          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $avant_hier = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::now()->subDays(2))
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-16' group by `user_id`

          }

          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $j_3 = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::now()->subDays(3))
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-15' group by `user_id`

          }

          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $j_4 = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::now()->subDays(4))
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-14' group by `user_id`

            ->where('user_id', auth()->user()->id)->get();
          }
        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $j_5 = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::now()->subDays(5))
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-13' group by `user_id`

          }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $j_6 = Recouvrement::selectRaw(
               'user_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('user_id')->whereDate('date', Carbon::now()->subDays(6))
            ->get();
---
select user_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-12' group by `user_id`



          if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $par_marche = Recouvrement::selectRaw(
               'marche_id,
                SUM(encours_actualise) as encours_actualise,
                SUM(recouvrement_jrs) as recouvrement_jrs,
                SUM(epargne_jrs) as epargne_jrs,
                SUM(assurance) as assurance,
                SUM(interet_jrs) as interet_jrs,
                SUM(retrait) as retrait')
            ->groupBy('marche_id')->whereDate('date', Carbon::today())
            ->get();
---
select marche_id,
SUM(encours_actualise) as encours_actualise,
SUM(recouvrement_jrs) as recouvrement_jrs,
SUM(epargne_jrs) as epargne_jrs,
SUM(assurance) as assurance,
SUM(interet_jrs) as interet_jrs,
SUM(retrait) as retrait from `recouvrements` where date(`date`) = '2024-04-18' group by `marche_id`




        $credit_j = Credit::where('statut', 'Accordé')->where('user_id', auth()->user()->id)->whereDate('date_deblocage', Carbon::today())->get();

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_hier = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::yesterday())->get();
---
select * from `credits` where `statut` = 'Accordé' and `user_id` = 2 and date(`date_deblocage`) = '2024-04-18'
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-17'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_j_2 = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::now()->subDays(2))->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-16'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_j_3 = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::now()->subDays(3))->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-15'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_j_4 = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::now()->subDays(4))->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-14'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_j_5 = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::now()->subDays(5))->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-13'

            $credits_j_5 = Credit::where('statut', 'Accordé')->where('user_id', auth()->user()->id)->whereDate('date_deblocage', Carbon::now()->subDays(5))->get();
        }
        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $credits_j_6 = Credit::where('statut', 'Accordé')->whereDate('date_deblocage', Carbon::now()->subDays(6))->get();
---
select * from `credits` where `statut` = 'Accordé' and date(`date_deblocage`) = '2024-04-12'

        }

        $marches = Marche::get();
        $agents = User::where('role_id', '2')->get();

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total = Recouvrement::whereDate('date', Carbon::today())->get();
---
select * from `users` where `role_id` = '2'
select * from `recouvrements` where date(`date`) = '2024-04-18'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_hier = Recouvrement::whereDate('date', Carbon::yesterday())->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-17'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_j_2 = Recouvrement::whereDate('date', Carbon::now()->subDays(2))->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-16'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_j_3 = Recouvrement::whereDate('date', Carbon::now()->subDays(3))->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-15'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_j_4 = Recouvrement::whereDate('date', Carbon::now()->subDays(4))->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-14'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_j_5 = Recouvrement::whereDate('date', Carbon::now()->subDays(5))->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-13'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $total_j_6 = Recouvrement::whereDate('date', Carbon::now()->subDays(6))->get();
---
select * from `recouvrements` where date(`date`) = '2024-04-12'

        }

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $epargnes = Credit::where('statut', 'Accordé')->get();
---
select * from `credits` where `statut` = 'Accordé'