app/Http/Controllers/EtatEncoursGlobalSIController.php

    public function index(Request $request)
    {


        $tool = new Tool();
        $credits = [];

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8) {
            $listes = Credit::where('statut', 'Accordé')->get();
---
select * from `credits` where `statut` = 'Accordé'