app/Http/Controllers/Etat_actualiseController.php

select * from `credits` where `statut` = 'Accordé' and date(`date_fin`) > '2024-02-08' or `type_id` = '2'
select * from `credits` where `statut` = 'Accordé' and `user_id` = 6 and date(`date_fin`) > '2024-02-08'
---
    public function index()
    {
        $tool = new Tool();
        $credits = [];

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6) {
            $listes = Credit::where('statut', 'Accordé')->whereDate('date_fin', '>', Carbon::today()->subDays(70))->orWhere('type_id', '2')->get();

            foreach ($listes as $liste) {

                $encours =  $tool->encours_actualiser($liste->id);

                if ($encours > 0) {
                    array_push($credits, $liste);
                }
            }
        } else {
            $listes = Credit::where('statut', 'Accordé')->where('user_id', auth()->user()->id)->whereDate('date_fin', '>', Carbon::today()->subDays(70))->get();

select * from `recouvrements`
---
        $marches = Marche::get();

        if (auth()->user()->role_id == 1 || auth()->user()->role_id == 6) {
            $total = Recouvrement::get();

select `marche_id`, SUM(encours_actualise) as total_encours_actualise, SUM(interet_jrs) as total_interet_jrs, SUM(recouvrement_jrs) as total_recouvrement_jrs, SUM(epargne_jrs) as total_epargne_jrs, SUM(assurance) as total_assurance, SUM(retrait) as total_retrait from `recouvrements` where `date` between '2024-04-18 16:00:49' and '2024-04-18 16:00:49' group by `marche_id`
select `credit_id`, SUM(encours_actualise) as total_encours_actualise, SUM(interet_jrs) as total_interet_jrs, SUM(recouvrement_jrs) as total_recouvrement_jrs, SUM(epargne_jrs) as total_epargne_jrs, SUM(assurance) as total_assurance, SUM(retrait) as total_retrait from `recouvrements` where date(`date`) <= '2024-04-19' group by `credit_id`
---
    public function encours(Request $request, $dd = NULL)
    {
        $tool = new Tool();

        $dd = Carbon::parse($request->dd);

        if($dd == NULL){
           $encours = Recouvrement::whereDate('date','<=', Date::now())->select('marche_id')
                ->selectRaw('SUM(encours_actualise) as total_encours_actualise')
                ->selectRaw('SUM(interet_jrs) as total_interet_jrs')
                ->selectRaw('SUM(recouvrement_jrs) as total_recouvrement_jrs')
                ->selectRaw('SUM(epargne_jrs) as total_epargne_jrs')
                ->selectRaw('SUM(assurance) as total_assurance')
                ->selectRaw('SUM(retrait) as total_retrait')
                ->groupBy('marche_id')
                ->get();

                $encoursClients = Recouvrement::whereDate('date','<=',Date::now())->select('credit_id')
                ->selectRaw('SUM(encours_actualise) as total_encours_actualise')
                ->selectRaw('SUM(interet_jrs) as total_interet_jrs')
                ->selectRaw('SUM(recouvrement_jrs) as total_recouvrement_jrs')
                ->selectRaw('SUM(epargne_jrs) as total_epargne_jrs')
                ->selectRaw('SUM(assurance) as total_assurance')
                ->selectRaw('SUM(retrait) as total_retrait')
                ->groupBy('credit_id')
                ->get();

            return view('recouvrement.encours', compact('encours', 'dd', 'encoursClients'));
        }

        $encours = Recouvrement::whereDate('date', '<=', $dd)->select('marche_id')
                ->selectRaw('SUM(encours_actualise) as total_encours_actualise')
                ->selectRaw('SUM(interet_jrs) as total_interet_jrs')
                ->selectRaw('SUM(recouvrement_jrs) as total_recouvrement_jrs')
                ->selectRaw('SUM(epargne_jrs) as total_epargne_jrs')
                ->selectRaw('SUM(assurance) as total_assurance')
                ->selectRaw('SUM(retrait) as total_retrait')
                ->groupBy('marche_id')
                ->get();


                $encoursClients = Recouvrement::whereDate('date','<=', $dd)->select('credit_id')
                ->selectRaw('SUM(encours_actualise) as total_encours_actualise')
                ->selectRaw('SUM(interet_jrs) as total_interet_jrs')
                ->selectRaw('SUM(recouvrement_jrs) as total_recouvrement_jrs')
                ->selectRaw('SUM(epargne_jrs) as total_epargne_jrs')
                ->selectRaw('SUM(assurance) as total_assurance')
                ->selectRaw('SUM(retrait) as total_retrait')
                ->groupBy('credit_id')
                ->get();