app/Http/Controllers/JournalierController.php

select * from `credits` where `statut` = 'Accordé' and `type_id` = '1' and date(`date_fin`) > '2024-03-19'
---
    public function index()
    {
        $tool = new Tool();
        $liste = [];
        $totalMontantParJour = 0;


        if(auth()->user()->role_id == 1 || auth()->user()->role_id == 6 || auth()->user()->role_id == 8){

          $credits = Credit::where('statut', 'Accordé')->where('type_id', '1')->whereDate('date_fin','>', Carbon::today()->subDays(30))->get();