app/Models/Credit.php

    public function getEpargne($item)
    {
        $epargnes = Recouvrement::where('credit_id', $item)->get();
---
select * from `recouvrements` where `credit_id` = 18