app/Models/Recouvrement.php

select * from `credits` where `statut` = 'Accordé' and `marche_id` = 1
select sum(`interet_jrs`) as aggregate from `recouvrements` where date(`date`) <= '2024-04-19' and `marche_id` = 1
select sum(`recouvrement_jrs`) as aggregate from `recouvrements` where date(`date`) <= '2024-04-19' and `marche_id` = 1
---
    public function encours($marche_id, $dd)
    {
        $dd = Carbon::parse($dd);

        $credits = Credit::where('statut', 'Accordé')->where('marche_id', $marche_id)->get();

        $ti = Recouvrement::whereDate('date', '<=', $dd)->where('marche_id', $marche_id)->sum('interet_jrs');
        $tr = Recouvrement::whereDate('date', '<=', $dd)->where('marche_id', $marche_id)->sum('recouvrement_jrs');

select * from `credits` where `statut` = 'Accordé' and `id` is null limit 1
select sum(`interet_jrs`) as aggregate from `recouvrements` where date(`date`) <= '2024-04-19' and `credit_id` is null
select sum(`recouvrement_jrs`) as aggregate from `recouvrements` where date(`date`) <= '2024-04-19' and `credit_id` is null
---
    public function encoursClient($credit_id, $dd)
    {
        $dd = Carbon::parse($dd);

        $credits = Credit::where('statut', 'Accordé')->where('id', $credit_id)->first();

        $ti = Recouvrement::whereDate('date', '<=', $dd)->where('credit_id', $credit_id)->sum('interet_jrs') ?? 0;
        $tr = Recouvrement::whereDate('date', '<=', $dd)->where('credit_id', $credit_id)->sum('recouvrement_jrs') ?? 0;

select * from `credits` where `credits`.`id` is null limit 1
---
    public function Client($credit_id)
    {
        $credit = Credit::find($credit_id);